{
"data":[
    {
      "destination": "Bavarian Alps: adventure awaits",
      "activity": "Forming a long natural divide along the Austrian border, the Bavarian Alps are a strikingly attractive spectacle. Take in the mountain views from the top of the Zugspitze. It's a panorama you will never forget. Easily reachable from Munich, outdoor enthusiasts will be in their element here with plenty of skiing, hiking and canoeing options. Those more intent on relaxation can unwind and unknot in a slew of top-notch spas.",
      "id": 1
    },
    {
      "destination": "Berlin: best for history and hedonism",
      "activity": "Blessed with the Brandenburg Gate, Charlottenburg Palace and Reichstag building, Berlin is rich in history, including volatile marks from the 20th century like the Führer Headquarters, the Holocaust-memorial and Berlin Wall. But brightened by street art, sound-tracked by an underground dance scene and thriving creatively, modern Berlin shines for visitors too.",
      "id": 2
    },
    {
      "destination": "Black Forest: from cake to cuckoo clock",
      "activity": "Few parts of Germany's countryside are as storied as the Black Forest: a dense, green mountain range in the southwest. Hiking is the best way to explore the photogenic beauty and sky-high peaks of this national park, while the forest is also home to a large number of small character-rich towns, including Triberg im Schwarzwald, which is home to the world's largest cuckoo clock. The famous Triberger waterfalls, close to Triberg, are the highest waterfalls in Germany. Although the dessert Black Forest gâteau is not directly named after the Black Forest mountain range, it does takes its name from the speciality liquor distilled from tart cherries in this region. The German name for Black Forest gâteau is Schwarzwälder Kirschtorte and the liquor is called  Schwarzwälder Kirsch(wasser).",
      "id": 3
    },
    {
      "destination": "Central Germany: walk the Rennsteig",
      "activity": "With its mountain ranges, tidal shores and mighty forests, the size and scope of Germany makes it a hiker's paradise. The historical ridge trail known as the Rennsteig leads for some 170 km (106 miles) from Eisenach and the Werra valley to Blankenstein and the Selbitz river. It passes through forests and highlands in the centre of the country, and combines rich culture with even richer scenery.",
      "id": 4
    },
    {
      "destination": "Cologne: carnival is a must",
      "activity": "Cologne knows how to have a good time and the Cologne carnival is one of the biggest events on the calendar. Expect lots of fancy dress, plenty of parties and parades. Also keep a lookout for ceremonial burning of straw figures, bouquets of flowers and cries of \"Kölle Alaaf\" (Long Live Cologne).",
      "id": 5
    },
    {
      "destination": "Dresden: a synonym for culture",
      "activity": "WWII left Dresden in a sorrowful state, but the city recovered sufficiently to become the spirited and arty destination it is today. It is handsome too, thanks in part to the Dresden Frauenkirche church, which was resurrected beautifully and restored as the skyline-dominating feature it deserves to be. Other must sees in Dresden are the museums in the Zwinger and in the Grüne Gewölbe, as well as the masterpieces in the Gemäldegalerie Alte Meister.",
      "id": 6
    },
    {
      "destination": "Essen: escape the past in Essen",
      "activity": "Crowned the European Capital of Culture in 2010, Essen has grown from a staid mining city into a remarkable example of how industrial infrastructure can be repurposed to artistic effect. Shaft 12 at Zollverein Coal Mine is now a Bauhaus-inspired and UNESCO-listed design museum, while the award of European Green Capital in 2017 is further proof that the city's industrial past has been truly usurped.",
      "id": 7
    },
    {
      "destination": "Frankfurt: search for its medieval core",
      "activity": "Frankfurt is best known as a financial centre (its gleaming office-block skyline has been coined 'Mainhattan') but there's much to draw cultural tourists too. Its historic core dates back to medieval times and several attractive landmark buildings remain, while its local tipple, Ebbelwoi (applewine), should be experienced and enjoyed. The 13 museums at the Museumsufer in Frankfurt play an important role in the German and European museum sector. Particularly noteworthy are the arts and craft museum, the museum of ethnology and the film museum.",
      "id": 8
    },
    {
      "destination": "Hamburg: find the city's beating heart",
      "activity": "As Germany's second largest metropolis, the northern port city of Hamburg offers rich pickings for tourists. Colourful and cosmopolitan, the city has music at its heart: retrace the steps of The Beatles along the Reeperbahn; enjoy the fervent live scene; or dance to DJs until the small hours. The Speicherstadt's neo-gothic canals are best explored at night. Or enjoy Hamburg's famous fair Hamburger Dom, which takes place in spring, summer and winter.",
      "id": 9
    },
    {
      "destination": "Heidelberg: fall in love with Germany's most romantic town",
      "activity": "Boasting a glorious woodland setting on the broad Neckar River, Heidelberg draws large numbers of visitors for its formidable renaissance castle, cosy cafes and literature-culture with bookshops, poetry events and academic happenings. Germany's oldest university town is also the birthplace of German Romanticism and is famed for its picturesque panoramas along the riverside Philosophers' Walk (Philosophenweg).",
      "id": 10
    },
    {
      "destination": "Moselle Valley: sample some of the best Rieslings ",
      "activity": "Getting to know the world-famous wineries of the Moselle Valley is a rewarding way to sample rural Germany. The Moselle River flows through France, Luxembourg, and Germany where it twists and turns between Trier and Koblenz. Aside the steep banks of the river Moselle, the culture remains traditional, pace of life slow and its scenery grandly evocative. The wines, including some of the best Rieslings, are well worthy of extensive acquaintance.",
      "id": 11
    },
    {
      "destination": "Munich: enjoy a beer at Oktoberfest",
      "activity": "First held in 1810, Munich's much eulogised festival is a 16-day celebration of Bavarian culture, with top billing afforded to local beers and belly-filling food. Expect fairground rides and live music too. However, if you're planning a visit, be aware that the majority of the festival falls in late September, despite its name.",
      "id": 12
    },
    {
      "destination": "Munich: watch a football match",
      "activity": "Germany's love affair with football reaches its pinnacle at the Allianz Arena, home of Bayern Munich. Snare a ticket and watch one of the continent’s top teams in action. Other lively options include Hamburg, Bayer Leverkusen, Hertha Berlin, Schalke 04 and Werder Bremen.",
      "id": 13
    },
    {
      "destination": "Nuremberg: visit the Chritkindlesmarkt",
      "activity": "The run-up to Christmas sees the towns and cities of the nation come alive with traditional street markets, and nowhere more so than in Nuremberg. Toys, gingerbread and handmade presents are among the countless festive items on sale at the famous Christkindlesmarkt, while warming Glühwein (mulled wine) forms an integral part of the experience.",
      "id": 14
    },
    {
      "destination": "Southern Germany: cycle the Romantic Road",
      "activity": "Germany has more than 200 long-distance cycle paths that spin from riverside routes and chocolate box villages to major cities and mountain-bike trails. Arguably the most picturesque of the lot is the 350km-long (220-mile) Romantic Road that stretches from Wurzburg (near Frankfurt) to Füssen in southern Germany, linking a number of charming towns and fairy-tale castles. And yes, tandem bikes are available to hire. The Romantic Road is marked along the way with brown signs.",
      "id": 15
    },
    {
      "destination": "Southern Germany: explore Neuschwanstein Castle",
      "activity": "The archetypal fairytale palace, world-famous Neuschwanstein stands among Alpine foothills in Bavaria. It's the most elaborate of King Ludwig II's castles, with much of its design inspired by Wagnerian operas. And if you think the outside looks dramatic, wait until you see the gilded decor and furnishings that the interior serves up. Avoid a visit to Neuschwanstein during the summer months if you don't want to get stuck in the crowd of the castle's 6000 daily visitors.",
      "id": 16
    },
    {
      "destination": "The Rhine: take a cruise",
      "activity": "The Rhine (spelt Rhein in German) is one of the longest rivers in Europe, and one of its most impressive to boot. Take a cruise from Koblenz past fairytale castles, pretty villages and the imposing Lorelei Rock, legendary home of a siren said to have lured boatmen to their demise.",
      "id": 17
    },
    {
      "destination": "Weimar: indulge your intellect at Weimar",
      "activity": "The 1,000-year-old city of Weimar has been home to many great writers, musicians, composers and poets, including Goethe, Luther, Bach, Liszt, Wagner and Schiller. An essential southern stop for any culture vulture, this creative centre experienced its golden age in the 18th and 19th centuries, and remains visually pleasing too.",
      "id": 18
    },
    {
      "images": "https://www.worldtravelguide.net/wp-content/themes/wtg/images/main-banner1.jpg",
      "id": 19
    },
    {
      "images": "https://worldtravelguide.net/sites/default/files/new-images/753x320/neuschwanstein-castle-ger-2877.jpg",
      "id": 20
    },
    {
      "images": "https://worldtravelguide.net/sites/default/files/new-images/753x320/aerial-view-of-rothenburg-2880.jpg",
      "id": 21
    },
    {
      "images": "https://worldtravelguide.net/sites/default/files/new-images/753x320/berlin-wall-germany-2883.jpg",
      "id": 22
    },
    {
      "images": "https://worldtravelguide.net/sites/default/files/new-images/753x320/hamburg-during-christmas-2886.jpg",
      "id": 23
    }
  ]
}